Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_regdef.h
/** \brief CAN object */
typedef volatile struct _Ifx_CAN
{
       Ifx_UReg_8Bit                       reserved_0[32768];      /**< \brief 0, \internal Reserved */
       Ifx_CAN_CLC                         CLC;                    /**< \brief 8000, CAN Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_8004[4];       /**< \brief 8004, \internal Reserved */
       Ifx_CAN_ID                          ID;                     /**< \brief 8008, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_800C[20];      /**< \brief 800C, \internal Reserved */
       Ifx_CAN_GRINT1                      GRINT1;                 /**< \brief 8020, Interrupt routing for Groups 1*/
       Ifx_CAN_GRINT2                      GRINT2;                 /**< \brief 8024, Interrupt routing for Groups 2*/
       Ifx_UReg_8Bit                       reserved_8028[8];       /**< \brief 8028, \internal Reserved */
       Ifx_CAN_MCR                         MCR;                    /**< \brief 8030, Module Control Register*/
       Ifx_CAN_BUFADR                      BUFADR;                 /**< \brief 8034, Buffer receive address and transmit address*/
       Ifx_UReg_8Bit                       reserved_8038[8];       /**< \brief 8038, \internal Reserved */
       Ifx_CAN_MECR                        MECR;                   /**< \brief 8040, Measure Control Register*/
       Ifx_CAN_MESTAT                      MESTAT;                 /**< \brief 8044, Measure Status Register*/
       Ifx_UReg_8Bit                       reserved_8048[144];     /**< \brief 8048, \internal Reserved */
       Ifx_CAN_ACCENCTR1                   ACCENCTR1;              /**< \brief 80D8, Access Enable Register CTR 1*/
       Ifx_CAN_ACCENCTR0                   ACCENCTR0;              /**< \brief 80DC, Access Enable Register Control 0*/
       Ifx_UReg_8Bit                       reserved_80E0[8];       /**< \brief 80E0, \internal Reserved */
       Ifx_CAN_OCS                         OCS;                    /**< \brief 80E8, OCDS Control and Status*/
       Ifx_CAN_KRSTCLR                     KRSTCLR;                /**< \brief 80EC, Kernel Reset Status Clear Register*/
       Ifx_CAN_KRST1                       KRST1;                  /**< \brief 80F0, Kernel Reset Register 1*/
       Ifx_CAN_KRST0                       KRST0;                  /**< \brief 80F4, Kernel Reset Register 0*/
       Ifx_CAN_ACCEN1                      ACCEN1;                 /**< \brief 80F8, Access Enable Register 1*/
       Ifx_CAN_ACCEN0                      ACCEN0;                 /**< \brief 80FC, Access Enable Register 0*/
       Ifx_CAN_N                           N[4];                   /**< \brief 8100, */
       Ifx_UReg_8Bit                       reserved_8EFC[516];     /**< \brief 8EFC, \internal Reserved */
} Ifx_CAN;

/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCAN_REGDEF_H */

